====================
Int fields
====================
:i count 2

--------------------
(document
  (int_field
    (field_marker)
    (identifier)
    (int_value))
)

====================
Blob fields (empty)
====================
:b empty 0


--------------------
(document
  (blob_field
    (field_marker)
    (identifier)
    (length)
    (blob_value))
)

====================
Blob fields
====================
:b text 13
Hello, world


--------------------
(document
  (blob_field
    (field_marker)
    (identifier)
    (length)
    (blob_value))
)

====================
Multiple fields
====================
:i count 2
:b text 13
Hello, world


--------------------
(document
  (int_field
    (field_marker)
    (identifier)
    (int_value))
  (blob_field
    (field_marker)
    (identifier)
    (length)
    (blob_value))
)

====================
Other order
====================
:b text 13
Hello, world

:i count 2

--------------------
(document
  (blob_field
    (field_marker)
    (identifier)
    (length)
    (blob_value))
  (int_field
    (field_marker)
    (identifier)
    (int_value))
)

====================
Valid identifiers
====================
:i with_underscore 1
:i with-dash 2
:i WithCaps 2

--------------------
(document
  (int_field
    (field_marker)
    (identifier)
    (int_value))
  (int_field
    (field_marker)
    (identifier)
    (int_value))
  (int_field
    (field_marker)
    (identifier)
    (int_value))
)

====================
Blobs with numbers
====================
:b hi 2
12

--------------------
(document
  (blob_field
    (field_marker)
    (identifier)
    (length)
    (blob_value))
)
